УТ.УчетЗадач/src/InformationRegisters/cbr_ПользовательскиеНастройки/cbr_ПользовательскиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ПользовательскиеНастройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.cbr_ВидыПользовательскихНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНастройки</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.cbr_ВидыПользовательскихНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/CommonForms/CRM_ПерсональныеНастройки/Module.bsl
&После ("ЗаполнитьДеревоНастроекОповещений")
Процедура ДобавитьНастройкиУведомленийЗадач()
	НастройкиЭлементы = ДеревоНастроекОповещений.ПолучитьЭлементы();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	cbr_ВидыПользовательскихНастроек.Ссылка,
	|	cbr_ВидыПользовательскихНастроек.Родитель,
	|	cbr_ВидыПользовательскихНастроек.ЭтоГруппа
	|ПОМЕСТИТЬ вт_ВсеНастройки
	|ИЗ
	|	ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек КАК cbr_ВидыПользовательскихНастроек
	|ГДЕ
	|	НЕ cbr_ВидыПользовательскихНастроек.ЭтоГруппа
	|	И
	|		cbr_ВидыПользовательскихНастроек.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.cbr_ВидыПользовательскихНастроек.СпособыОповещения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ВсеНастройки.Ссылка КАК ВидОповещения,
	|	cbr_ПользовательскиеНастройки.Значение КАК Напоминание,
	|	вт_ВсеНастройки.Родитель КАК Родитель
	|ИЗ
	|	вт_ВсеНастройки КАК вт_ВсеНастройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ПользовательскиеНастройки КАК cbr_ПользовательскиеНастройки
	|		ПО вт_ВсеНастройки.Ссылка = cbr_ПользовательскиеНастройки.ВидНастройки
	|		И cbr_ПользовательскиеНастройки.Пользователь = &Пользователь
	|ИТОГИ
	|ПО
	|	Родитель";

	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	ВыборкаГрупп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГрупп.Следующий() Цикл
		СтрокаГруппы = НастройкиЭлементы;
		СтрокаНастройкиРодитель = СтрокаГруппы.Добавить();
		СтрокаНастройкиРодитель.ВидОповещения = ВыборкаГрупп.Родитель;
		СтрокаНастройкиРодитель.ВидОповещенияЭтоГруппа = Истина;
		СтрокаГруппыЭлементы = СтрокаНастройкиРодитель.ПолучитьЭлементы();
		
		Выборка = ВыборкаГрупп.Выбрать();
		Пока Выборка.Следующий() Цикл				
			СтрокаНастройки = СтрокаГруппыЭлементы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНастройки, Выборка);
			СтрокаНастройки.НомерКартинки = 1;			
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&Вместо ("ОбновитьНастройкиОповещений")
Функция СохранитьНастройкиОповещенийМод()
	РезультатОбновленияНастроекОповещений = Новый Структура;
	РезультатОбновленияНастроекОповещений.Вставить("ОшибкаЗаписиОповещений", Ложь);
	НаборЗаписей = РегистрыСведений.CRM_ОповещенияПользовательскиеНастройки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НастройкиГруппы = ДеревоНастроекОповещений.ПолучитьЭлементы();
	
	Для Каждого ГруппаНастроек Из НастройкиГруппы Цикл
		
		НастройкиЭлементы = ГруппаНастроек.ПолучитьЭлементы();
		
		//Исключение настроек оповещения по задачам
		Если ГруппаНастроек.ВидОповещения = ПланыВидовХарактеристик.cbr_ВидыПользовательскихНастроек.СпособыОповещения Тогда
			Набор = РегистрыСведений.cbr_ПользовательскиеНастройки.СоздатьНаборЗаписей();
			Набор.Отбор.Пользователь.Установить(ТекущийПользователь);
			Набор.Прочитать();
			Набор.Очистить();
		
			Для Каждого СтрокаДерева Из НастройкиЭлементы Цикл
				Запись = Набор.Добавить();
				Запись.Пользователь = ТекущийПользователь;
				Запись.ВидНастройки = СтрокаДерева.ВидОповещения;
				Запись.Значение = СтрокаДерева.Напоминание;
			КонецЦикла;
	
			Набор.Записать(РежимЗамещения.Слияние);
			
			Продолжить;
		КонецЕсли;
		//Исключение настроек оповещения по задачам
		
		Для Каждого СтрокаНастроек Из НастройкиЭлементы Цикл
			
			Если СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.Оповещение_1") 
				ИЛИ СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.Оповещение_2") 
				ИЛИ СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.Оповещение_3") 
				ИЛИ СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ОповещатьОНовыхВходящихПисьмах")
				ИЛИ СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ОповещатьОНовыхСообщенияхМессенджеров")
				ИЛИ СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ОповещенияОДняхРождения")
				ИЛИ СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.CRM_ОповещенияОКлючевыхСобытиях") Тогда
				ЕстьОшибка = Ложь;
				ДопускаетсяНеУказыватьСрок = 
					(СтрокаНастроек.ВидОповещения = ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ОповещенияОДняхРождения")
					Или СтрокаНастроек.ВидОповещения = 
					ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.CRM_ОповещенияОКлючевыхСобытиях"));
				Если НЕ ЗначениеЗаполнено(СтрокаНастроек.СрокОповещения) 
					И Не ДопускаетсяНеУказыватьСрок
					И (СтрокаНастроек.Напоминание
					 ИЛИ СтрокаНастроек.SMS
					 ИЛИ СтрокаНастроек.Мессенджер
					 ИЛИ СтрокаНастроек.Email) Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ru='Для оповещения ""'") + СтрокаНастроек.ВидОповещения.Наименование 
						+ НСтр("ru='"" не указан срок.'");
					Сообщение.Сообщить();
					РезультатОбновленияНастроекОповещений.Вставить("ОшибкаЗаписиОповещений", Истина);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаНастроек.Периодичность) И (СтрокаНастроек.Напоминание
					 ИЛИ СтрокаНастроек.SMS
					 ИЛИ СтрокаНастроек.Мессенджер
					 ИЛИ СтрокаНастроек.Email) Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ru='Для оповещения ""'") + СтрокаНастроек.ВидОповещения.Наименование 
						+ НСтр("ru='"" не указан период.'");
					Сообщение.Сообщить();
					РезультатОбновленияНастроекОповещений.Вставить("ОшибкаЗаписиОповещений", Истина);
					ЕстьОшибка = Истина;
				КонецЕсли;
				Если ЕстьОшибка Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			Запись = НаборЗаписей.Добавить();
			
			Запись.Пользователь		= ТекущийПользователь;
			Запись.ВидОповещения	= СтрокаНастроек.ВидОповещения;
			Запись.СрокОповещения	= СтрокаНастроек.СрокОповещения;
			Запись.Периодичность	= СтрокаНастроек.Периодичность;
			Запись.Напоминание		= СтрокаНастроек.Напоминание;
			Запись.СМС				= СтрокаНастроек.SMS;
			Запись.ЭлектроннаяПочта	= СтрокаНастроек.Email;
			Запись.Мессенджер		= СтрокаНастроек.Мессенджер;
			
			Если СтрокаНастроек.ВидОповещения = Справочники.CRM_ВидыОповещений.КоммерческоеПредложениеСумма
				ИЛИ СтрокаНастроек.ВидОповещения = Справочники.CRM_ВидыОповещений.СчетСумма Тогда
				Запись.Сумма = СтрокаНастроек.Отбор;
				
			ИначеЕсли СтрокаНастроек.ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещатьОНовыхВходящихПисьмах Тогда
				
				ПодключитьОбработчик = Ложь;
				
				Если (СтрокаНастроек.Напоминание <> ОповещенияОВходящихПисьмахНапоминание)  Тогда
					
					Если ОповещенияОВходящихПисьмахНапоминание Тогда
						
						РезультатОбновленияНастроекОповещений.Вставить("ОтключитьОбработчикОповещенияОВходящихПисьмах", Истина);
						
					Иначе	
					
						РезультатОбновленияНастроекОповещений.Вставить("ПодключитьОбработчикОповещенияОВходящихПисьмах", Истина);
						
					КонецЕсли;
					
				ИначеЕсли СтрокаНастроек.СрокОповещения <> ОповещенияОВходящихПисьмахСрокОповещения
					  ИЛИ СтрокаНастроек.Периодичность <> ОповещенияОВходящихПисьмахПериодичность Тогда
					
					РезультатОбновленияНастроекОповещений.Вставить("ПодключитьОбработчикОповещенияОВходящихПисьмах", Истина);
				
				КонецЕсли;
							Запись.Сумма = СтрокаНастроек.Отбор;
				
			ИначеЕсли СтрокаНастроек.ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещатьОНовыхСообщенияхМессенджеров Тогда
				
				ПодключитьОбработчик = Ложь;
				
				Если (СтрокаНастроек.Напоминание <> ОповещенияОСообщенияхМессенджеровНапоминание)  Тогда
					
					Если ОповещенияОСообщенияхМессенджеровНапоминание Тогда
						
						РезультатОбновленияНастроекОповещений.Вставить("ОтключитьОбработчикОповещенияОСообщенияхМессенджеров", Истина);
						
					Иначе	
					
						РезультатОбновленияНастроекОповещений.Вставить("ПодключитьОбработчикОповещенияОСообщенияхМессенджеров", Истина);
						
					КонецЕсли;
					
				ИначеЕсли СтрокаНастроек.СрокОповещения <> ОповещенияОСообщенияхМессенджеровСрокОповещения
					  Или СтрокаНастроек.Периодичность <> ОповещенияОСообщенияхМессенджеровПериодичность Тогда
					
					РезультатОбновленияНастроекОповещений.Вставить("ПодключитьОбработчикОповещенияОСообщенияхМессенджеров", Истина);
				
				КонецЕсли;
				
			Иначе
				Если ЭтоАдресВременногоХранилища(СтрокаНастроек.АдресВоВременномХранилище) Тогда
					Запись.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтрокаНастроек.АдресВоВременномХранилище),
						 Новый СжатиеДанных(9));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	НаборЗаписей.Записать();
	
	Возврат РезультатОбновленияНастроекОповещений;
КонецФункции
